package org.cyy.config;

/**
 * @author cyy
 * @date 2022/2/18 11:23
 * @description 整个插件系统所以回复信息的配置文件
 */
public interface ReplyMessage {
    /*
        异常回应信息
     */
    String authExceptionMsg = "抱歉啦,需要重新登录，请@我回复（登录）进行登录.";
    String ioExceptionMsg = "出现意外啦,再试一次吧，多次出现问题请及时联系：1597081640.";
    String groupFileExceptionMsg = "抱歉啦,没有该群的配置文件请联系:1597081640添加吧.";

    /*
        签到相关信息
     */
    String allIsSignMsg = "今日已全部签到";

    /*
        登录相关
     */
    String baseCookieIsErrorMsg = "这个cookie已经使用太久啦,联系我1597081640进行更换吧！";
    String pushToLoginQueueMsg = "共有%d位在登录队列中，您在第%d位,当到您登录时，系统会发送验证码给您，请等待.";
    String notIsFrontMsg = "请等待他人操作完毕后再进行操作.";
    String isFrontMsg = "请您回复验证码进行登录";
    String pleaseSendCode = "请回复验证码\n(格式为:\"验证码:xxxx\")\n";
    String loginTimeOutMsg = "超时未操作！";
    String loginOkMsg = "登录成功！";
    String loginNotOkMsg = "登录失败！请重新登录，多次失败请联系我1597081640";

    /*
        使用方法
     */
    String useMethodMsg ="使用方法:\n" +
            "    联系(qq:1597081640,下文代指我),添加配置文件，之后便可使用。\n" +
            "    机器人支持手动和定时自动催签到，①手动:直接在群里发送\"催签到\"即可，机器人便会at未签到同学，②定时自动:机器人会在固定时间{9.00,10.00,11.00,12.00,14.00}自动at未签到同学。\n" +
            "  关于at失败:请先检查同学备注是否为自己的真实姓名(包含真实姓名即可)，如果备注正确仍然at失败请截图并将同学的备注发给我。\n" +
            "    关于cookie失效:根据提示at机器人回复登录二字，然后根据机器人回复的验证码图片，回复\"验证码:xxxx\"，注意回复格式。登录成功后便可以正常使用了。\n" +
            "    最后，需要添加其他功能或者定制机器人请联系我！\n";
    String newUseMethodMsg="使用方法\n"+
            "1. 催签到功能(详细介绍回复“催签到介绍”)： \n" +
            "  ○ 群里发送：\"催签到\"\n" +
            "  ○ 群里发送：@bot\"登录\"\n" +
            "2. 信息推送功能(详细介绍回复“信息推送介绍”): \n" +
            "  ○ 群里或者私聊发送:\"添加推送好友:好友qq号\"\n" +
            "  ○ 群里或者私聊发送:\"删除推送好友:好友qq号\"\n" +
            "  ○ 群里或者私聊发送:\"添加推送子群:qq群号\"\n" +
            "  ○ 群里或者私聊发送:\"删除推送子群:qq群号\"\n" +
            "  ○ 群里或者私聊发送:\"查看推送目标\"\n" +
            "  ○ 群里或者私聊发送:\"开始推送\"\n" +
            "  ○ 群里或者私聊发送:\"结束推送\"\n" +
            "  ○ 群里@全体成员自动推送\n" +
            "3.  查看使用方法: \n" +
            "  ○ 群里或者私聊发送:\"使用方法\",或者直接戳一戳机器人\n" +
            "4.  动态开启以上功能(仅限机器人master) \n" +
            "  ○ 开启/关闭催签到功能\n" +
            "  ○ 开启/关闭自动催签到\n" +
            "  ○ 开启/关闭登录\n" +
            "  ○ 开启/关闭加好友\n" +
            "  ○ 开启/关闭加群\n" +
            "  ○ 开启/关闭信息推送\n" +
            "5. 机器人管理命令(仅限机器人master):\n" +
            "  ○ 查看状态命令:/status\n" +
            "  ○ 查看文件夹命令:/查看文件夹  文件夹\n" +
            "  ○ 查看文件内容命令:/查看文件 文件夹 文件\n" +
            "  ○ 删除文件夹命令:/删除文件夹 文件\n" +
            "  ○ 删除文件命令:/删除文件 文件夹 文件\n" +
            "  ○ 通知命令:/通知 通知内容\n" +
            "最后:(强烈建议点此阅读文档:1.https://www.yuque.com/docs/share/a45dcbdf-2e68-46f1-bb18-87b25180cc8f?#\n" +
            "或者\n" +
            "2.https://bigcyy.github.io/2022/03/15/CYY%E6%9C%BA%E5%99%A8%E4%BA%BA%E4%BD%BF%E7%94%A8%E4%BB%8B%E7%BB%8D/)";
    String signUseMethodMsg = "催签到功能介绍\n" +
            "\n" +
            "面向对象：成都师范学院希望自动催签到的用户\n" +
            "\n" +
            "模块：\n" +
            "\n" +
            "1. 手动催签到模块:在群里发送\"催签到\",机器人将会@未签到同学信息将会在90分钟后自动撤回\n" +
            "2. 自动催签到模块:机器人将在每天的9.00,11.00,12.00,13.00,14.00,15.00自动@未签到同学\n" +
            "3. 登录模块 :在群里@机器人并回复登录进行登录，登录成功后才可进行催签到，当多人同时进行登录时，可能需要进行排队等待，根据提示操作即可。\n" +
            "\n" +
            "第一次使用：\n" +
            "\n" +
            "1. 联系我(1597081640)，提供您的学院，专业信息，以及辅导员健康系统的账号和密码\n" +
            "\n" +
            "2. 等待我添加配置文件后，将机器人拉入学院或班级或专业群\n" +
            "3. at机器人并回复\"登录\",进行首次登录\n" +
            "4. 登录完成后即可使用\n" +
            "\n" +
            "目前仅适配成都师范学院\n" +
            "\n";
    String pushMsgUseMethodMsg = "## 信息推送功能介绍\n" +
            "\n" +
            "面向对象:社团部门负责人，辅导员，班委，干事，希望对多个群信息进行整合的同学\n" +
            "\n" +
            "使用情景:\n" +
            "\n" +
            "1. 你是否因为通知群太多时常置顶十几个群？使用信息推送功能，机器人将会把各通知群里的信息合并推送给你，你只需要查看机器人给你发送的信息即可！如图\n" +
            "2. 你是否因为要管理多个群，当发送通知时需要复制粘贴信息到多个群窗口进行通知而感到焦愁，使用信息推送功能，你只需向机器人发送一次通知，机器人便可以将通知信息发给你需要通知的所有群，如图\n" +
            "3. 将专业群里@全体同学的重要信息自动推送到配置的班级小群\n" +
            "\n" +
            "使用方法(建议先了解下面的几个名词)：\n" +
            "\n" +
            "1. 先确定你要以怎样的形式进行信息推送，在群里进行信息推送？或者私聊机器人进行信息推送\n" +
            "2. 设置推送对象，群里或者私聊发送：“添加推送子群:qq群号”，“添加推送好友:好友qq号”\n" +
            "3. 群里或者私聊发送：“开始推送”，开启信息推送\n" +
            "4. 群里或者私聊发送“结束推送”，结束信息推送\n" +
            "5. 一旦在群里配置了推送目标，@全体成员的信息就会自动推送到推送目标\n" +
            "6. 群里或者私聊发送：“删除推送子群:qq群号”,删除子群，“删除推送好友:好友qq号”,删除推送好友\n" +
            "\n" +
            "基础名词：\n" +
            "\n" +
            "信息源,待推送信息，推送目标\n" +
            "\n" +
            "1. 信息源:指待推送信息的来源，可以为一个群，和个人。当你在群里进行信息推送时，信息源就是该群，当你在打开和机器人的聊天窗口进行信息推送时，信息源就是你本人。\n" +
            "\n" +
            "2. 待推送信息:支持普通文本，图片，文件(目前仅支持群->群),语音(目前仅支持本人->好友，群->群)\n" +
            "\n" +
            "3. 推送目标：群和好友\n" +
            "\n" +
            "* 注:信息源和推送目标是通过机器人联系起来的，将待推送信息从群->群，群->好友，本人->好友。所以需要邀请机器人进入群，加机器人为好友。希望你我一起构建信息推送的生态\n" +
            "\n" +
            "\n" +
            "\n";
    /*
        推送信息相关
     */
    String childGroupNotFindMsg = "机器人未添加该群%s,请先邀请机器人进群再添加！";
    String childPersonNotFindMsg = "机器人未添加该好友%s,请先让该用户添加机器人为好友再添加！";

    String repeatAddChildGroupMsg = "请勿重复添加推送子群！";
    String repeatAddChildPersonMsg = "请勿重复添加推送好友！";
    String addChildSuccessMsg = "添加成功！";

    String notAnyChildMsg = "未配置任何子群和个人！";
    String deleteChildUnSuccessMsg = "删除失败!";
    String deleteChildSuccessMsg = "删除成功!";

    String noChildMsg = "还没有子群和个人。";
    String allChildMsg = "可以推送的目标有:\n群:\n%s好友:\n%s";
    String rePushMsg = "正在推送，请勿重复发送指令.";
    String beginPushMsg = "ok,请发送消息，发送完成后回复“结束推送”,结束转发";
    String endPushIsOkMsg = "ok";

    String pushMsgSuccessPrefixMsg = "来自%s的消息:\n"; //%s(%s:%s)
    String pushMsgOkMsg = "已经成功推送到：\n%s";
    String pushMsgNotOkMsg = "机器人未加以下群或好友,推送失败：\n";
    String pushMsgTimeoutMsg = "操作超时，以上消息已经推送，信息推送自动结束";
    /*
        缓存相关
     */
    String cacheIsOk = "缓存成功";
    String cacheNotOk = "以下成员缓存失败:%s";
}
